Revit 2018 API
Rebar.ArrayLength Property
 Identifies the distribution path length of rebar set.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.0)
Since: 2009
Syntax
C#
[ObsoleteAttribute("This property is deprecated in Revit 2018 and will be removed in the next version of Revit. We suggest you use the GetShapeDrivenAccessor().ArrayLength property instead.")]
public double ArrayLength { get; set; }
Visual Basic
<ObsoleteAttribute("This property is deprecated in Revit 2018 and will be removed in the next version of Revit. We suggest you use the GetShapeDrivenAccessor().ArrayLength property instead.")> _
Public Property ArrayLength As Double
	Get
	Set
Visual C++
[ObsoleteAttribute(L"This property is deprecated in Revit 2018 and will be removed in the next version of Revit. We suggest you use the GetShapeDrivenAccessor().ArrayLength property instead.")]
public:
property double ArrayLength {
	double get ();
	void set (double value);
}
Field Value
 The distribution path length of rebar set.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: the set length arrayLength isn't acceptable.
Autodesk.Revit.Exceptions.DisabledDisciplineException |  When setting this property: None of the following disciplines is enabled: Structural.
Autodesk.Revit.Exceptions.InapplicableDataException |  This rebar element represents a single bar (the layout rule is Single).
Autodesk.Revit.Exceptions.InvalidOperationException |  This method applies only to shape driven rebar.
See Also
Rebar Class
Autodesk.Revit.DB.Structure Namespace